myapp/app/views/tasks/_form.html.erb

SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 102 LIMIT 1
---
      <%= f.label :status %>
      <%= f.select :status, Task.statuses.keys.map { |k| [t("enums.task.status.#{k}"), k]} %>