myapp/app/views/tasks/index.html.erb

  <%= f.search_field :name_or_description_or_priority_or_status_or_duedate_cont%>
  <%= f.submit t('pages.task_list_page.search') %>
---
SELECT `tasks`.* FROM `tasks`