myapp/app/controllers/tasks_controller.rb

SELECT  `tasks`.* FROM `tasks` ORDER BY priority is null, priority, end_date LIMIT 11
---
  def index
    @tasks = Task.search(status: params[:status], keyword: params[:keyword], sort: params[:sort], direction: params[:direction]).page(params[:page])

SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 102 LIMIT 1
---
  def show
    @task = Task.find(params[:id])

SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 102 LIMIT 1
---
  def edit
    @task = Task.find(params[:id])

INSERT INTO `tasks` (`name`, `description`, `priority`, `status`, `duedate`, `created_at`, `updated_at`) VALUES ('ashbf', 'ajbsd', 'Low', 'Done', '2024-09-08', '2024-02-26 05:39:32.771846', '2024-02-26 05:39:32.771846')
---
  def create
    @task = Task.new(task_params)

    if @task.save

SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 104 LIMIT 1
UPDATE `tasks` SET `tasks`.`priority` = 'Low', `tasks`.`updated_at` = '2024-02-27 01:59:50.194265' WHERE `tasks`.`id` = 8
---
  def update
    @task = Task.find(params[:id])

    if @task.update(task_params)

DELETE FROM `tasks` WHERE `tasks`.`id` = 5
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 4 LIMIT 1
---
  def destroy
    if Task.find(params[:id]).destroy